row = input("Введіть рядок\n")

print("третій символ цього рядка:", row[2])
print("передостанній символ цього рядка:", row[-2])
print("перші п'ять символів цього рядка:", row[:5])
print("довжина цього рядка:", len(row))
print("весь рядок, крім двох останніх символів:", row[0:-2])
print("усі символи у зворотному порядку:", row[::-1])
print("усі символи рядка через один у зворотному порядку, починаючи з останнього:", row[::-2])
print("усі символи з парними індексами:", row[::2])
print("усі символи з непарними індексами:", row[1::2])








